Revit 2027 API
IFCUserDefinedPropertySet.AddProperty Method
 Adds a property to the property set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddProperty(
	IFCUserDefinedProperty userDefinedProperty
)
Public Sub AddProperty (
	userDefinedProperty As IFCUserDefinedProperty
)
public:
void AddProperty(
	IFCUserDefinedProperty^ userDefinedProperty
)
member AddProperty :
        userDefinedProperty : IFCUserDefinedProperty -> unit
Parameters
userDefinedProperty IFCUserDefinedProperty
Exceptions
Exception | Condition
ArgumentException |  A property set with the given name already exists in the property set.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCUserDefinedPropertySet Class
Autodesk.Revit.DB Namespace